
## Plan Result (tiny_virtual_machines)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 7 to add, 0 to change, 8 to destroy.</code></pre>

* Create
  * module.tiny_virtual_machines[&#34;bunkerweb0&#34;].proxmox_virtual_environment_file.cloud_config
  * module.tiny_virtual_machines[&#34;bunkerweb0&#34;].proxmox_virtual_environment_vm.vm
  * module.tiny_virtual_machines[&#34;bunkerweb1&#34;].proxmox_virtual_environment_file.cloud_config
  * module.tiny_virtual_machines[&#34;bunkerweb1&#34;].proxmox_virtual_environment_vm.vm
* Delete
  * terraform_data.ansible[&#34;test-vms&#34;]
  * module.tiny_virtual_machines[&#34;bunkerweb-test&#34;].proxmox_virtual_environment_file.cloud_config
  * module.tiny_virtual_machines[&#34;bunkerweb-test&#34;].proxmox_virtual_environment_vm.vm
  * module.tiny_virtual_machines[&#34;bunkerweb-test-1&#34;].proxmox_virtual_environment_file.cloud_config
  * module.tiny_virtual_machines[&#34;bunkerweb-test-1&#34;].proxmox_virtual_environment_vm.vm
* Replace
  * proxmox_virtual_environment_download_file.tiny_images[&#34;hela-jammy-server-cloudimg-amd64.img&#34;]
  * proxmox_virtual_environment_download_file.tiny_images[&#34;loki-jammy-server-cloudimg-amd64.img&#34;]
  * proxmox_virtual_environment_download_file.tiny_images[&#34;thor-jammy-server-cloudimg-amd64.img&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # proxmox_virtual_environment_download_file.tiny_images["hela-jammy-server-cloudimg-amd64.img"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "tiny_images" {
      ~ id                  = "local:iso/jammy-server-cloudimg-amd64.img" -> (known after apply)
      ~ size                = 667116544 -> (known after apply) # forces replacement
        # (9 unchanged attributes hidden)
    }

  # proxmox_virtual_environment_download_file.tiny_images["loki-jammy-server-cloudimg-amd64.img"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "tiny_images" {
      ~ id                  = "local:iso/jammy-server-cloudimg-amd64.img" -> (known after apply)
      ~ size                = 667116544 -> (known after apply) # forces replacement
        # (9 unchanged attributes hidden)
    }

  # proxmox_virtual_environment_download_file.tiny_images["thor-jammy-server-cloudimg-amd64.img"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "tiny_images" {
      ~ id                  = "local:iso/jammy-server-cloudimg-amd64.img" -> (known after apply)
      ~ size                = 667116544 -> (known after apply) # forces replacement
        # (9 unchanged attributes hidden)
    }

  # terraform_data.ansible["test-vms"] will be destroyed
  # (because key ["test-vms"] is not in for_each map)
  - resource "terraform_data" "ansible" {
      - id               = "d04ecd2f-bd08-0c6c-0b17-80e9604dbc3b" -> null
      - triggers_replace = [
          - "04032025",
          - <<-EOT
                - name: Update system and install docker
                  hosts:
                    - bunkerweb-test
                    - bunkerweb-test-1
                  become: true
                  become_user: root
                  become_method: sudo
                  roles:
                    - role: prep
                      install_pkgs: ["apt-transport-https", "ca-certificates", "curl", "software-properties-common"]
                    - role: install-docker
            EOT,
        ] -> null
    }

  # module.tiny_virtual_machines["bunkerweb-test"].proxmox_virtual_environment_file.cloud_config will be destroyed
  # (because module.tiny_virtual_machines["bunkerweb-test"] is not in configuration)
  - resource "proxmox_virtual_environment_file" "cloud_config" {
      - content_type   = "snippets" -> null
      - datastore_id   = "local" -> null
      - file_name      = "bunkerweb-test-cloud-config.yaml" -> null
      - id             = "local:snippets/bunkerweb-test-cloud-config.yaml" -> null
      - node_name      = "loki" -> null
      - overwrite      = true -> null
      - timeout_upload = 1800 -> null

      - source_raw {
          - data      = (sensitive value) -> null
          - file_name = "bunkerweb-test-cloud-config.yaml" -> null
          - resize    = 0 -> null
        }
    }

  # module.tiny_virtual_machines["bunkerweb-test"].proxmox_virtual_environment_vm.vm will be destroyed
  # (because module.tiny_virtual_machines["bunkerweb-test"] is not in configuration)
  - resource "proxmox_virtual_environment_vm" "vm" {
      - acpi                    = true -> null
      - bios                    = "seabios" -> null
      - description             = "BunkerWeb Test VM" -> null
      - id                      = "301" -> null
      - ipv4_addresses          = [
          - [
              - "127.0.0.1",
            ],
          - [
              - "10.151.14.201",
            ],
          - [
              - "172.17.0.1",
            ],
          - [
              - "172.18.0.1",
            ],
          - [
              - "10.20.30.1",
            ],
          - [
              - "172.19.0.1",
            ],
          - [
              - "172.20.0.1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
        ] -> null
      - ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [
              - "fe80::be24:11ff:fe45:4652",
            ],
          - [],
          - [
              - "fe80::70c2:3ff:fefe:1c9c",
            ],
          - [
              - "fe80::4451:61ff:fee5:83e7",
            ],
          - [
              - "fe80::bcee:1aff:fe94:2c7f",
            ],
          - [
              - "fe80::dc57:b5ff:fe10:8aee",
            ],
          - [
              - "fe80::84f7:fbff:fed8:8f51",
            ],
          - [
              - "fe80::b48a:6eff:feb0:e7f4",
            ],
          - [
              - "fe80::61:b5ff:fe33:c314",
            ],
          - [
              - "fe80::4898:3dff:fe0a:2d06",
            ],
          - [
              - "fe80::b83b:31ff:fed9:1ef8",
            ],
          - [
              - "fe80::f8c2:6ff:fe26:7654",
            ],
          - [
              - "fe80::5884:fbff:fee9:7ced",
            ],
          - [
              - "fe80::d45c:25ff:feb6:537e",
            ],
          - [
              - "fe80::e405:abff:fe86:d890",
            ],
          - [
              - "fe80::6c30:26ff:fed5:c4c2",
            ],
          - [
              - "fe80::8c06:a4ff:fe1b:f9ef",
            ],
        ] -> null
      - keyboard_layout         = "en-us" -> null
      - mac_addresses           = [
          - "00:00:00:00:00:00",
          - "BC:24:11:45:46:52",
          - "7E:0A:E5:C0:77:68",
          - "72:C2:03:FE:1C:9C",
          - "46:51:61:E5:83:E7",
          - "BE:EE:1A:94:2C:7F",
          - "DE:57:B5:10:8A:EE",
          - "86:F7:FB:D8:8F:51",
          - "B6:8A:6E:B0:E7:F4",
          - "02:61:B5:33:C3:14",
          - "4A:98:3D:0A:2D:06",
          - "BA:3B:31:D9:1E:F8",
          - "FA:C2:06:26:76:54",
          - "5A:84:FB:E9:7C:ED",
          - "D6:5C:25:B6:53:7E",
          - "E6:05:AB:86:D8:90",
          - "6E:30:26:D5:C4:C2",
          - "8E:06:A4:1B:F9:EF",
        ] -> null
      - migrate                 = false -> null
      - name                    = "bunkerweb-test" -> null
      - network_interface_names = [
          - "lo",
          - "eth0",
          - "docker0",
          - "br-5027c8869053",
          - "br-2a0511b2904e",
          - "br-1bb1a35f3d40",
          - "br-db80f583ffdd",
          - "vethf048807",
          - "veth22f0e99",
          - "vethe8958bf",
          - "veth79fe24f",
          - "veth25dd4f9",
          - "vethdd5196d",
          - "veth6f30fd3",
          - "veth7349f1c",
          - "vethc743ea9",
          - "veth5cd90bc",
          - "vethd5feb23",
        ] -> null
      - node_name               = "loki" -> null
      - on_boot                 = true -> null
      - protection              = false -> null
      - reboot                  = false -> null
      - reboot_after_update     = true -> null
      - scsi_hardware           = "virtio-scsi-pci" -> null
      - started                 = true -> null
      - stop_on_destroy         = false -> null
      - tablet_device           = true -> null
      - tags                    = [
          - "terraform",
        ] -> null
      - template                = false -> null
      - timeout_clone           = 1800 -> null
      - timeout_create          = 1800 -> null
      - timeout_migrate         = 1800 -> null
      - timeout_move_disk       = 1800 -> null
      - timeout_reboot          = 1800 -> null
      - timeout_shutdown_vm     = 1800 -> null
      - timeout_start_vm        = 1800 -> null
      - timeout_stop_vm         = 300 -> null
      - vm_id                   = 301 -> null
        # (2 unchanged attributes hidden)

      - agent {
          - enabled = true -> null
          - timeout = "15m" -> null
          - trim    = false -> null
          - type    = "virtio" -> null
        }

      - cpu {
          - architecture = "x86_64" -> null
          - cores        = 1 -> null
          - flags        = [] -> null
          - hotplugged   = 0 -> null
          - limit        = 0 -> null
          - numa         = false -> null
          - sockets      = 1 -> null
          - type         = "host" -> null
          - units        = 1024 -> null
            # (1 unchanged attribute hidden)
        }

      - disk {
          - aio               = "io_uring" -> null
          - backup            = true -> null
          - cache             = "none" -> null
          - datastore_id      = "local-lvm" -> null
          - discard           = "on" -> null
          - file_format       = "raw" -> null
          - file_id           = "local:iso/jammy-server-cloudimg-amd64.img" -> null
          - interface         = "virtio0" -> null
          - iothread          = true -> null
          - path_in_datastore = "vm-301-disk-0" -> null
          - replicate         = true -> null
          - size              = 8 -> null
          - ssd               = false -> null
            # (1 unchanged attribute hidden)
        }

      - initialization {
          - datastore_id         = "local-lvm" -> null
          - interface            = "ide2" -> null
          - upgrade              = false -> null
          - user_data_file_id    = "local:snippets/bunkerweb-test-cloud-config.yaml" -> null
            # (4 unchanged attributes hidden)

          - ip_config {
              - ipv4 {
                  - address = "10.151.14.201/24" -> null
                  - gateway = "10.151.14.1" -> null
                }
            }
        }

      - memory {
          - dedicated      = 4096 -> null
          - floating       = 0 -> null
          - keep_hugepages = false -> null
          - shared         = 0 -> null
            # (1 unchanged attribute hidden)
        }

      - network_device {
          - bridge       = "vmbr0" -> null
          - disconnected = false -> null
          - enabled      = true -> null
          - firewall     = false -> null
          - mac_address  = "BC:24:11:45:46:52" -> null
          - model        = "virtio" -> null
          - mtu          = 0 -> null
          - queues       = 0 -> null
          - rate_limit   = 0 -> null
          - vlan_id      = 0 -> null
            # (1 unchanged attribute hidden)
        }

      - operating_system {
          - type = "l26" -> null
        }

      - startup {
          - down_delay = -1 -> null
          - order      = 1 -> null
          - up_delay   = 1 -> null
        }
    }

  # module.tiny_virtual_machines["bunkerweb-test-1"].proxmox_virtual_environment_file.cloud_config will be destroyed
  # (because module.tiny_virtual_machines["bunkerweb-test-1"] is not in configuration)
  - resource "proxmox_virtual_environment_file" "cloud_config" {
      - content_type   = "snippets" -> null
      - datastore_id   = "local" -> null
      - file_name      = "bunkerweb-test-1-cloud-config.yaml" -> null
      - id             = "local:snippets/bunkerweb-test-1-cloud-config.yaml" -> null
      - node_name      = "hela" -> null
      - overwrite      = true -> null
      - timeout_upload = 1800 -> null

      - source_raw {
          - data      = (sensitive value) -> null
          - file_name = "bunkerweb-test-1-cloud-config.yaml" -> null
          - resize    = 0 -> null
        }
    }

  # module.tiny_virtual_machines["bunkerweb-test-1"].proxmox_virtual_environment_vm.vm will be destroyed
  # (because module.tiny_virtual_machines["bunkerweb-test-1"] is not in configuration)
  - resource "proxmox_virtual_environment_vm" "vm" {
      - acpi                    = true -> null
      - bios                    = "seabios" -> null
      - description             = "BunkerWeb Test VM" -> null
      - id                      = "302" -> null
      - ipv4_addresses          = [
          - [
              - "127.0.0.1",
            ],
          - [
              - "10.151.14.202",
            ],
        ] -> null
      - ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [
              - "fe80::be24:11ff:fecd:bc3d",
            ],
        ] -> null
      - keyboard_layout         = "en-us" -> null
      - mac_addresses           = [
          - "00:00:00:00:00:00",
          - "BC:24:11:CD:BC:3D",
        ] -> null
      - migrate                 = false -> null
      - name                    = "bunkerweb-test-1" -> null
      - network_interface_names = [
          - "lo",
          - "eth0",
        ] -> null
      - node_name               = "hela" -> null
      - on_boot                 = true -> null
      - protection              = false -> null
      - reboot                  = false -> null
      - reboot_after_update     = true -> null
      - scsi_hardware           = "virtio-scsi-pci" -> null
      - started                 = true -> null
      - stop_on_destroy         = false -> null
      - tablet_device           = true -> null
      - tags                    = [
          - "terraform",
        ] -> null
      - template                = false -> null
      - timeout_clone           = 1800 -> null
      - timeout_create          = 1800 -> null
      - timeout_migrate         = 1800 -> null
      - timeout_move_disk       = 1800 -> null
      - timeout_reboot          = 1800 -> null
      - timeout_shutdown_vm     = 1800 -> null
      - timeout_start_vm        = 1800 -> null
      - timeout_stop_vm         = 300 -> null
      - vm_id                   = 302 -> null
        # (2 unchanged attributes hidden)

      - agent {
          - enabled = true -> null
          - timeout = "15m" -> null
          - trim    = false -> null
          - type    = "virtio" -> null
        }

      - cpu {
          - architecture = "x86_64" -> null
          - cores        = 1 -> null
          - flags        = [] -> null
          - hotplugged   = 0 -> null
          - limit        = 0 -> null
          - numa         = false -> null
          - sockets      = 1 -> null
          - type         = "host" -> null
          - units        = 1024 -> null
            # (1 unchanged attribute hidden)
        }

      - disk {
          - aio               = "io_uring" -> null
          - backup            = true -> null
          - cache             = "none" -> null
          - datastore_id      = "local-lvm" -> null
          - discard           = "on" -> null
          - file_format       = "raw" -> null
          - file_id           = "local:iso/jammy-server-cloudimg-amd64.img" -> null
          - interface         = "virtio0" -> null
          - iothread          = true -> null
          - path_in_datastore = "vm-302-disk-0" -> null
          - replicate         = true -> null
          - size              = 8 -> null
          - ssd               = false -> null
            # (1 unchanged attribute hidden)
        }

      - initialization {
          - datastore_id         = "local-lvm" -> null
          - interface            = "ide2" -> null
          - upgrade              = false -> null
          - user_data_file_id    = "local:snippets/bunkerweb-test-1-cloud-config.yaml" -> null
            # (4 unchanged attributes hidden)

          - ip_config {
              - ipv4 {
                  - address = "10.151.14.202/24" -> null
                  - gateway = "10.151.14.1" -> null
                }
            }
        }

      - memory {
          - dedicated      = 4096 -> null
          - floating       = 0 -> null
          - keep_hugepages = false -> null
          - shared         = 0 -> null
            # (1 unchanged attribute hidden)
        }

      - network_device {
          - bridge       = "vmbr0" -> null
          - disconnected = false -> null
          - enabled      = true -> null
          - firewall     = false -> null
          - mac_address  = "BC:24:11:CD:BC:3D" -> null
          - model        = "virtio" -> null
          - mtu          = 0 -> null
          - queues       = 0 -> null
          - rate_limit   = 0 -> null
          - vlan_id      = 0 -> null
            # (1 unchanged attribute hidden)
        }

      - operating_system {
          - type = "l26" -> null
        }

      - startup {
          - down_delay = -1 -> null
          - order      = 1 -> null
          - up_delay   = 1 -> null
        }
    }

  # module.tiny_virtual_machines["bunkerweb0"].proxmox_virtual_environment_file.cloud_config will be created
  + resource "proxmox_virtual_environment_file" "cloud_config" {
      + content_type           = "snippets"
      + datastore_id           = "local"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "loki"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_raw {
          + data      = (sensitive value)
          + file_name = "bunkerweb0-cloud-config.yaml"
          + resize    = 0
        }
    }

  # module.tiny_virtual_machines["bunkerweb0"].proxmox_virtual_environment_vm.vm will be created
  + resource "proxmox_virtual_environment_vm" "vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "BunkerWeb Test VM"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "bunkerweb0"
      + network_interface_names = (known after apply)
      + node_name               = "loki"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + stop_on_destroy         = false
      + tablet_device           = true
      + tags                    = [
          + "terraform",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 301

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cpu {
          + architecture = "x86_64"
          + cores        = 1
          + hotplugged   = 0
          + limit        = 0
          + numa         = false
          + sockets      = 1
          + type         = "host"
          + units        = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "on"
          + file_format       = (known after apply)
          + file_id           = "local:iso/jammy-server-cloudimg-amd64.img"
          + interface         = "virtio0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 8
          + ssd               = false
        }

      + initialization {
          + datastore_id      = "local-lvm"
          + upgrade           = (known after apply)
          + user_data_file_id = (known after apply)

          + ip_config {
              + ipv4 {
                  + address = "10.151.14.201/24"
                  + gateway = "10.151.14.1"
                }
            }
        }

      + memory {
          + dedicated      = 4096
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + startup {
          + down_delay = -1
          + order      = 1
          + up_delay   = 1
        }
    }

  # module.tiny_virtual_machines["bunkerweb1"].proxmox_virtual_environment_file.cloud_config will be created
  + resource "proxmox_virtual_environment_file" "cloud_config" {
      + content_type           = "snippets"
      + datastore_id           = "local"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "loki"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_raw {
          + data      = (sensitive value)
          + file_name = "bunkerweb1-cloud-config.yaml"
          + resize    = 0
        }
    }

  # module.tiny_virtual_machines["bunkerweb1"].proxmox_virtual_environment_vm.vm will be created
  + resource "proxmox_virtual_environment_vm" "vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "BunkerWeb Test VM"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "bunkerweb1"
      + network_interface_names = (known after apply)
      + node_name               = "loki"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + stop_on_destroy         = false
      + tablet_device           = true
      + tags                    = [
          + "terraform",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 301

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cpu {
          + architecture = "x86_64"
          + cores        = 1
          + hotplugged   = 0
          + limit        = 0
          + numa         = false
          + sockets      = 1
          + type         = "host"
          + units        = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "on"
          + file_format       = (known after apply)
          + file_id           = "local:iso/jammy-server-cloudimg-amd64.img"
          + interface         = "virtio0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 8
          + ssd               = false
        }

      + initialization {
          + datastore_id      = "local-lvm"
          + upgrade           = (known after apply)
          + user_data_file_id = (known after apply)

          + ip_config {
              + ipv4 {
                  + address = "10.151.14.202/24"
                  + gateway = "10.151.14.1"
                }
            }
        }

      + memory {
          + dedicated      = 4096
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + startup {
          + down_delay = -1
          + order      = 1
          + up_delay   = 1
        }
    }

Plan: 7 to add, 0 to change, 8 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":493,"Program":"tfcmt","SHA1":"","Target":"tiny_virtual_machines","Vars":{}} -->